Revit 2027 API
CoordinationModelPositioning Enumeration
 An enumerated type listing possible placement modes for linking Coordination Models.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum CoordinationModelPositioning
Public Enumeration CoordinationModelPositioning
public enum class CoordinationModelPositioning
type CoordinationModelPositioning
Members
Member name | Value | Description
BySharedCoordinates | 1 |  The Coordination Model instance will be placed in Revit document by shared coordinates.
OriginToInternalOrigin | 0 |  The Coordination Model instance will be placed in Revit document from origin to internal origin.
See Also
Reference
Autodesk.Revit.DB.ExternalData Namespace